-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1:3306
-- Generation Time: Feb 05, 2022 at 01:12 AM
-- Server version: 8.0.24
-- PHP Version: 7.1.33

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `romak`
--

-- --------------------------------------------------------

--
-- Table structure for table `main`
--

CREATE TABLE `main` (
  `Тип загрози` text NOT NULL,
  `Назва активу` text NOT NULL,
  `Власник активу` text NOT NULL,
  `Мусце розташування` text NOT NULL,
  `Категорія активу` text NOT NULL,
  `Загроза` text CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `Джерело загрози` text NOT NULL,
  `Механізм реалізації нападу` text NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

--
-- Dumping data for table `main`
--

INSERT INTO `main` (`Тип загрози`, `Назва активу`, `Власник активу`, `Мусце розташування`, `Категорія активу`, `Загроза`, `Джерело загрози`, `Механізм реалізації нападу`) VALUES
('Цілісність  ', 'Персональні дані Клієтнів', 'Директор', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних', 'Хакер', 'Несанкціонований доступ до системи по IP-адресі робочої станції через відсутність Firewall'),
('Цілісність  ', 'Персональні дані Клієтнів', 'Директор', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних', 'Хакер', 'Несанкціонований доступ до системи по IP-адресі робочої станції через відсутність Firewall'),
('Цілісність', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Системний адміністратор', 'Проникнення в систему під час відсутності  власника активу за робочим комп’ютером через відсутність ПЗ, яке аутентифікує користувача ,запароленого входу в обліковий запис.'),
('Цілісність', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Системний адміністратор', 'Проникнення в систему під час відсутності  власника активу за робочим комп’ютером через відсутність ПЗ «чорний екран»'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Хакер', 'Потрапляння в систему зловмисного ПЗ через відсутність відповідного ПЗ для захисту (антивірус)'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Хакер', 'Потрапляння в систему зловмисного ПЗ, при відкритті неперевіреного файла працівником  через непроведення інструктажів для працівників (відсутність політики безпеки)'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Системний адміністратор', 'Потрапляння в систему зловмисного ПЗ через відсутність заборони на використання особистих флеш-накопичувачів'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Системний адміністратор', 'Потрапляння в систему зловмисного ПЗ через відсутність заборони на встановлення неліцензійного ПЗ'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Порушення цілісності даних', 'Користувач веб-сайту компанії', 'Введення неправильних даних під час реєстрації на веб-сайті, що призведе до порушення цілісності даних, що зберігаються на сервері, через відсутність тестування ПЗ'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження несанкціонованого, непротестованого або зловмисного ПЗ (віруси,\r\nтроянські коні тощо)', 'Хакер', 'Надсилання зловмисних файлів на електронну пошту директора з подальшим викраденням, видаленням, зміною бази даних'),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Логічні бомби', 'Хакер', 'Потрапляння у систему логічної бомби через непроведення інструктажів для працівників '),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до безпровідної мережі організації', 'Хакер', 'Несанкціоноване отримання доступу до маршрутизатора, використовуючи  спеціальні програми перебору паролів, через наявність слабкого паролю на маршрутизаторі '),
('Цілісність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Використання помилок конфігурації ПЗ', 'Хакер', 'Використання помилок у конфігурації ПЗ через відсутність контролю змін в конфігураційних файлах '),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Хакер', 'ВРуйнування даних внаслідок потрапляння в систему зловмисного ПЗ при відкритті неперевіреного файла працівником  через непроведення інструктажів для працівників (відсутність політики безпеки ) '),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження несанкціонованого ПЗ', 'Системний адміністратор', 'Руйнування даних внаслідок потрапляння в систему несанкціонованого ПЗ через  відсутність заборони на встановлення неперевіреного або неліцензійного ПЗ (відсутність політики безпеки) '),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Логічні бомби', 'Хакер', 'Руйнування даних внаслідок потрапляння у систему логічної бомби через непроведення інструктажів для працівників (невпровадження політики безпеки )'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Флуктуації у мережі електроживлення', 'Техногенне', 'Втрата доступу до активу через пошкодження обладнання компанії через відсутність стабілізаторів живлення'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Системний збій', 'Системний адміністратор', 'Руйнування даних через системний збій по причині використання непротестованого ПЗ'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Атака на відмову на віддалений сервер', 'Хакер', 'Відсутність доступу до активу через проведення DOS(DDoS) атаки по причині відсутності ПЗ, яке блокує типи атак на відмову'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Збій системи електроживлення', 'Техногенне', 'Відсутність доступу до активу через відсутність джерела безперебійного живлення'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Збій системи електроживлення', 'Конкурент', 'Спецагент фірми конкурента Відсутність доступу до активу через пошкодження проводки електроживлення ззовні будівлі через відсутність системи відеоспостереження'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Блискавка', 'Блискавка', 'Пошкодження проводки електроживлення та обладнання через відсутність захисту від блискавки і заземлення '),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Природні катастрофи', 'Стихійні явища', 'Природні катаклізми внаслідок чого можуть статися пошкодження персонального комп`ютера і внаслідок цього база персональних даних користтувачів буде не доступна. Відсутність інструкції щодо дій при надзвичайних ситуаціях.'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'Умисне руйнування критичної для бізнесу інформації ', 'Хакер ', 'Надсилання зловмисних файлів на електронну пошту директора з метою отримання доступу до даних комп’ютера.'),
('Доступність ', 'Персональні дані клієнтів', 'Директор', 'Сервер ', 'Електронний документ', 'НСД до резервних копій даних. ', 'Хакер ', 'Отримання доступу до комп’ютера з-зовні, з метою, видалення резевних даних та бази даних. В наслідок цього дані будуть не доступні. Можливе через недостатнє навчання інформаційної безпеці, відсутність оновлення ПЗ. омп’ютера.'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних', 'Системний адміністратор', 'Отримання доступу до активу через відсутність розмежування доступу у мережі (зловживання обов’язками)'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних', 'Хакер', 'Несанкціоноване отримання доступу до даних по IP-адресі сервера через відсутність Firewall.'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних', 'Хакер', 'Впровадження зловмисного ПЗ в систему по IP-адресі сервера та отримання даних через відсутність ПЗ для захисту (антивірус))'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до даних, що передаються мережами зв’язку', 'Системний адміністратор', 'Пасивне прослуховування каналів зв’язку з використанням спеціальних програмних засобів («сніферів») через відсутність внутрішньої перевірки встановленого ПЗ.'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Витік інформації', 'Системний адміністратор', 'Копіювання інформації на фізичний носій через відсутність заборони використання особистих накопичувачів'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Несанкціонований доступ до резервних копій', 'Хакер', 'Впровадження в систему зловмисних програм, що  перехоплюють паролі до серверу, в результаті отримують  несанкціонований доступ до даних через відсутність заборони встановлювати неперевірене ПЗ'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Перегляд інформації з екранів дисплеїв за допомогою оптичних засобів', 'Конкурент', 'Зчитування інформації з дисплею керівника компанії за допомогою спеціальних оптичних засобів через відсутність технології затемнення вікон'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Прослуховування зовнішніх каналів зв’язку зловмисниками', 'Хакер', 'Зловмисник може перехоплювати дані які директор передає під час розмови по телефону, переселання пошти.'),
('Конфіденційність', 'Персональні дані клієнтів', 'Директор ', 'Сервер', 'Електронний документ', 'Заміна,  встановлення,  видалення або  зміна  даних  користувачів в інформаційному \r\nпотоці.', 'Хакер', 'Під час передачі персональних даних користувачів з сервера на персональний комп/ютер і навпаки, зловминик може використовувати спеціальні програми для перехоплення та зміни конфіденційної інформації.'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до обладнання', 'Хакер', 'Впровадження в систему робочого комп’ютера спеціальних  зловмисних програм, під видом іншої програми, які перехоплюють паролі до серверу, як результат несанкціонований доступ до даних через відсутність заборони встановлювати неперевірене ПЗ'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Внесення випадкових або умисних змін у ПЗ', 'Хакер', 'Доступ до сервера по IP-адресі та внесення змін у ПЗ, що призведе до порушення його функціонування та руйнування даних, через наявність слабкого паролю на сервері'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Впровадження несанкціонованого ПЗ', 'Системний адміністратор', 'Впровадження несанкціонованого ПЗ через відсутність внутрішньої перевірки встановленого програмного забезпечення'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до безпровідної мережі організації', 'Хакер', 'Несанкціоноване отримання доступу до маршрутизатора, використовуючи  спеціальні програми перебору паролів, через наявність слабкого паролю на маршрутизаторі'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Помилка персоналу', 'Системний адміністратор', 'Порушення цілісності програмного забезпечення на сервері через помилку під час внесення змін у його конфігураційні файли через відсутність контролю змін в конфігураційних файлах'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Впровадження зловмисного ПЗ', 'Хакер', 'Потрапляння в систему зловмисного ПЗ через відсутність відповідного ПЗ для захисту (антивірус)'),
('Цілісність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Впровадження несанкціонованого ПЗ (віруси,\r\nтроянські коні тощо)', 'Хакер', 'XSS атаки і таким чином передати зловмисний файл на нього. Головною ціллю зловмисника є отримання доступу до сервера, з подальшим викраденням, видаленням, зміною баз даних.'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Збій системи електроживлення', 'Техногенне', 'Відсутність доступу до активу через відсутність джерела безперебійного живлення'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Впровадження зловмисного ПЗ', 'Бухгалтер', 'Руйнування даних внаслідок потрапляння в систему зловмисного ПЗ через відсутність відповідного ПЗ для захисту (антивіруса)'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Впровадження несанкціонованого ПЗ', 'Системний адміністратор', 'Руйнування даних внаслідок потрапляння в систему несанкціонованого ПЗ через  відсутність заборони на встановлення неперевіреного або неліцензійного ПЗ (відсутність політики безпеки)'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Логічні бомби', 'Хакер', 'Руйнування даних внаслідок потрапляння у систему логічної бомби через непроведення інструктажів для працівників (невпровадження політики безпеки )'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Збій системи електроживлення', 'Техногенне', 'Відсутність доступу до активу через відсутність джерела безперебійного живлення'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Збій системи електроживлення', ' Конкурент', 'Відсутність доступу до активу через пошкодження проводки електроживлення ззовні будівлі через відсутність системи відеоспостереження'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Збій системи електроживлення', ' Блискавка', 'Пошкодження проводки електроживлення та обладнання через відсутність захисту від блискавки і заземлення'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Атака на відмову на сервер', ' Хакер', 'Проведення DOS атаки по причині відсутності ПЗ, яке блокує типи атак на відмову'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Системний збій', ' Системний адміністратор', 'Руйнування даних через системний збій по причині використання непротестованого ПЗ'),
('Доступність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Внесення випадкових або умисних змін у ПЗ', ' Системний адміністратор', 'Внесення змін у ПЗ, що призведе до порушення його функціонування та руйнування даних, через непроведення інструктажів для працівників'),
('Конфіденційність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до обладнання', ' Хакер', 'Несанкціоноване отримання доступу до серверу по його IP-адресі через відсутність Firewall'),
('Конфіденційність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до обладнання', ' Хакер', 'Впровадження зловмисного ПЗ в систему по IP-адресі сервера через відсутність ПЗ для захисту (антивірус)'),
('Конфіденційність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до обладнання', ' Бухгалтер', 'Отримання доступу до серверу по його IP-адресі через відсутність розмежування доступу в мережі'),
('Конфіденційність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Несанкціонований доступ до безпровідної мережі організації', ' Хакер', 'Несанкціоноване отримання доступу до маршрутизатора та прослуховування мережі за допомогою спеціальних програм(“сніферів”) для отримання логіна та паролю до сервера через наявність слабкого паролю на маршрутизаторі'),
('Конфіденційність ', 'Сервер', 'Системний адміністратор', 'Кабінет ', 'Комп’ютерна техніка', 'Ненавмисне розкриття інформації', ' Системний адміністратор', 'Отримання інформації спецагентами конкуруючої фірми за допомогою “виманювання” через непроведення інструктажів для працівників'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Руйнування даних з причин помилок у ПЗ', 'Системний адміністратор', 'Руйнування даних, спричинене помилкою під час їх обробки, через використання непротестованого ПЗ'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження несанкціонованого ПЗ', 'Системний адміністратор', 'Впровадження несанкціонованого ПЗ через відсутність внутрішньої перевірки встановленого програмного забезпечення'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Системний адміністратор', 'Отримання доступу до комп’ютера, який має доступ до активу, через відсутність розмежування доступу у мережі (зловживання обов’язками)'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Пошкодження носіїв інформації', 'Системний адміністратор', 'Помилка під час обробки даних, що призведе до руйнування носіїв інформації, через використання непротестованого ПЗ'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Умисне руйнування критичної інформації', 'Бухгалтер', 'Впровадження шкідливого ПЗ на сервер, що призведе до руйнування даних, через відсутність ПЗ для захисту (антивірус)'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Умисне руйнування критичної інформації', 'Бухгалтер', 'Впровадження шкідливого ПЗ на сервер, що призведе до руйнування даних, через відсутність ПЗ для захисту (антивірус)'),
('Цілісність', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Впровадження зловмисного ПЗ', 'Хакер', 'Потрапляння в систему зловмисного ПЗ через відсутність відповідного ПЗ для захисту (антивірус)'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Збій системи електроживлення', 'Техногенне', 'Відсутність доступу до активу через відсутність джерела безперебійного живлення'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Збій системи електроживлення', 'конкурент', 'Відсутність доступу до активу через пошкодження проводки електроживлення ззовні будівлі через відсутність системи відеоспостереження'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Збій системи електроживлення', 'Блискавка', 'Пошкодження проводки електроживлення та обладнання через відсутність захисту від блискавки (заземлення)'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Атака на відмову на сервер', 'Хакер', 'Проведення DOS атаки по причині відсутності ПЗ, яке блокує типи атак на відмову'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Системний збій', 'Системний адміністратор', 'Руйнування даних через системний збій по причині використання непротестованого ПЗ'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Внесення випадкових або умисних змін у ПЗ', 'Системний адміністратор', 'Внесення змін у ПЗ, що призведе до порушення його функціонування та руйнування даних, через непроведення інструктажів для працівників'),
('Доступність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Внесення випадкових або умисних змін у ПЗ', 'Системний адміністратор', 'Внесення змін у ПЗ, що призведе до порушення його функціонування та руйнування даних, через непроведення інструктажів для працівників'),
('Конфіденційність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Витік інформації', 'Системний адміністратор', 'Передавання інформації мережами зв’язку через відсутність перевірки трафіку'),
('Конфіденційність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Витік інформації', 'Системний адміністратор', 'Копіювання інформації на фізичний носій через відсутність заборони використання особистих накопичувачів'),
('Конфіденційність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Бухгалтер', 'Отримання доступу до даних по IP-адресі сервера через відсутність розмежування доступу в мережі'),
('Конфіденційність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Бухгалтер', 'Проникнення в систему під час відсутності  власника активу за робочим комп’ютером через відсутність ПЗ, яке  аутентифікує користувача (запароленого входу в обліковий запис)'),
('Конфіденційність ', 'Договори компанії', 'Директор', 'Сервер ', 'Електронний документ', 'Несанкціонований доступ до даних', 'Бухгалтер', 'Проникнення в систему під час відсутності  власника активу за робочим комп’ютером через відсутність ПЗ «чорний екран»');
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
